CREATE TABLE T_ACCOMMODATION (
  accomNum int auto_increment,
  accomName varchar(50) NOT NULL,
  accomTel varchar(50) NOT NULL,
  accomCategoryNum int NOT NULL,   -- 카테고리 (모텔, 호텔, 펜션)
  regionNum int NOT NULL,       -- 지역
  accomAddress varchar(200) NOT NULL,
  accomRating DECIMAL(2,1) NOT NULL,
  accomWishListCount int NOT null,
  totalreviewNum int NOT NULL,   -- 숙소의 총 리뷰 수
  latitude decimal(16,14) NOT NULL,	-- 위도
  longitude decimal(17,14) NOT NULL,	-- 경도
  lowPrice int NOT NULL,         -- 숙소의 모든 객실중에서 가장 낮은 가격
  reserveRange int NOT NULL,      -- 예약 가능 범위(예를 들어서 60으로 설정해두면 오늘로부터 +60일까지만 예약이 가능합니다.)
  PRIMARY KEY (`accomNum`),
  CONSTRAINT FK_9 FOREIGN KEY (regionNum) REFERENCES T_REGION(regionNum)on delete cascade,
  CONSTRAINT FK_25 FOREIGN KEY (accomCategoryNum) REFERENCES T_ACCOM_CATEGORY (accomCategoryNum)on delete cascade
)AUTO_INCREMENT=1;


INSERT INTO `T_ACCOMMODATION` (`accomName`,`accomTel`,`accomCategoryNum`,`regionNum`,`accomAddress`,`accomRating`,`accomWishListCount`,`totalreviewNum`,`latitude`,`longitude`,`lowPrice`,`reserveRange`)
VALUES
  ("대구 팔공산 스타탄생 드라이브인","050350508086",2,12,"대구광역시 동구 파계로138길 36",4.4,116,1163,0,0,20000,60),
("역삼 컬리넌","050350524475",2,1,"서울 강남구 언주로87길 11 (역삼동)",4.4,307,3074,37.5015,127.0421,30000,60),
("인천(검단) 3S BOTIQUE HOTEL","050350525953",2,3,"인천광역시 서구 원당대로 874",4.7,115,1150,37.5925,126.6709,25000,60),
("포항 영일대 HOTEL LILY(릴리)","050350507719",2,13,"경상북도 포항시 북구 해안로 57-2",4.7,82,824,36.0543,129.3767,35000,60),
("인천(석남동) 뱅크","050350526460",2,3,"인천광역시 서구 염곡로 250",4.7,30,302,37.507,126.6685,15000,60),
("글래드 마포","0221975000",1,1,"서울특별시 마포구 마포대로 92",4.8,660,6608,37.507, 126.6685,80000,60),
("제주 탑아일랜드 호텔","0647551333",1,5,"제주특별자치도 제주시 용남1길 47",4.7,20,200,33.5052, 126.5129,10000,60),
("선릉 호텔 스타","050350518700",1,1,"서울특별시 강남구 선릉로92길 8",4.2,448,4480,37.5054, 127.0494,25000,60),
("호텔 라트리 의정부","0318435100",1,2,"경기도 의정부시 청사로6번길 19-13 (신곡동)",3.6,3,33,37.75, 127.072,90000,60),
("탑스텐 빌라드애월","0647209000",1,5,"제주특별자치도 제주시 애월읍 애월해안로 516-7",4.6,14,144,33.4774, 126.3593,85000,60),
("대부도(선재도) 갤러리스파펜션(목섬 앞)","050350572152",3,3,"인천 옹진군 영흥면 선재로 38-47",4.5,95,959,37.2338, 126.5339,89000,60),
("보령(대천) 도로시펜션","050350588477",3,8,"충청남도 보령시 고잠2길 8-22",4.8,14,140,37.2338, 126.5339,60000,60),
("제주 귤하우스","050350528116",3,5,"제주특별자치도 서귀포시 남원읍 남한로 79-11",0.1,0,1,33.2857, 126.7136,55300,60),
("제주 동백바다","050350528071",3,5,"제주특별자치도 서귀포시 남원읍 태위로360번길 46",0.1,0,1,33.2726, 126.6841,90000,60),
("포항 씨엔스톤펜션","050350579434",3,13,"경상북도 포항시 북구 청하면 해안로1918번길34-1",4.6,29,298,36.1759, 129.3947,59400,60),
("보령(대천) 너울펜션","050350577805",3,8,"충청남도 보령시 해수욕장13길 10-20",4.4,110,1103,36.3196, 126.5092,45000,60),
("서울 아폴로 게스트하우스","050350521568",4,1,"서울특별시 영등포구 영등포로19길 7-1",4.2,12,127,37.5228, 126.8927,20000,60),
("노마드인제주 게스트하우스","050350520907",4,5,"제주특별자치도 제주시 용마로4길 5",4.8,15,152,33.516, 126.5059,25000,60),
("서울숲 스테이","050350521343",4,1,"서울특별시 성동구 왕십리로 108-1",4.5,16,163,37.5475, 127.0448,15000,60),
("제주 토다 게스트하우스","050350527102",4,5,"제주특별자치도 제주시 동문로 10",4.8,3,38,33.5128, 126.5278,19000,60);