CREATE TABLE T_BOARD (
	boardNum int auto_increment,
	boardCategoryNum int NOT NULL,
	boardTitle varchar(200) NOT NULL,
	boardContent varchar(3096),
	boardCreate datetime NOT NULL,
	PRIMARY KEY (`boardNum`),
CONSTRAINT FK_27 FOREIGN KEY (boardCategoryNum) REFERENCES T_BOARD_CATEGORY(boardCategoryNum) on delete cascade
)AUTO_INCREMENT=1;


INSERT INTO `T_BOARD` (`boardCategoryNum`,`boardTitle`,`boardContent`,`boardCreate`)
VALUES 
(1, "공지사항공지사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-08-06"),
(3, "이런저런사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-09-06"),
(3, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-16"),
(4, "가을겨울사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-02-11"),
(4, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-03-16"),
(5, "가을겨울사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-04-06"),
(5, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-05-16"),
(6, "가을사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-06"),
(6, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-01-16"),
(7, "가을사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-01-06"),
(7, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-02-16"),
(8, "가을사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-01"),
(8, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-07-11"),
(9, "가을겨울사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-02"),
(9, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-08-13"),
(10, "가을겨울사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-03"),
(11, "여름사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-09-16"),
(12, "가을겨울사항", "빈라이프구조디비구조리액트다른코드미치는", "2022-10-06");