
CREATE TABLE T_COUPON (
  couponNum int auto_increment,
  couponName varchar(50) NOT NULL,
  discountPrice int NOT NULL, --  고정 할인 금액
  couponStartDate datetime NOT NULL,
  couponEndDate datetime NOT NULL,
  useTerms int NOT NULL,  --  사용 조건(ex. 40,000원 이상)
  PRIMARY KEY (`couponNum`)
)AUTO_INCREMENT=1;


INSERT INTO `T_COUPON` (`couponName`,`discountPrice`,`couponStartDate`,`couponEndDate`,`useTerms`)
VALUES
  ("가입환영 10000원 할인 쿠폰", 10000,"2022-09-20","2022-12-20 23:59:59", 100000),
  ("여름휴가 5000원 할인 쿠폰", 5000,"2022-07-20","2022-11-20 23:59:59", 50000),
  ("미리예약 20000원 쿠폰", 20000,"2022-09-02","2022-12-25 23:59:59", 100000),
  ("얼리버드 15000원 쿠폰", 15000,"2022-09-05","2022-12-20 23:59:59", 80000),
  ("겨울나기 30000원 쿠폰", 30000,"2022-09-20","2022-11-25 23:59:59", 120000),
  ("너와나 쿠폰", 30000,"2022-10-22","2022-11-30 23:59:59", 100000),
  ("X4 시즌패스 쿠폰", 10000,"2022-09-11","2022-11-04 23:59:59", 40000),
  ("10,11월 한정 쿠폰", 40000,"2022-10-01","2022-11-30 23:59:59", 200000),
  ("천고마비의 계절 쿠폰", 30000,"2022-09-21","2022-11-19 23:59:59", 150000),
  ("숙박대전 쿠폰", 30000,"2022-09-22","2022-10-28 23:59:59", 100000);